ci/mutations/001-concat-copies-b-first.patch
diff --git a/crates/almide-wasm/src/runtime.rs b/crates/almide-wasm/src/runtime.rs
index 975d3a364..a4061da6a 100644
--- a/crates/almide-wasm/src/runtime.rs
+++ b/crates/almide-wasm/src/runtime.rs
@@ -499,7 +499,7 @@ pub(crate) fn emit_concat() -> Function {
     // Tiny copies take a BYTE LOOP: wasmtime lowers memory.copy to an
     // out-of-line libcall whose fixed cost dwarfs a 2-8 byte move (the
     // stage-54 micro-profile put ~20ns on each tiny concat).
-    for (which, off_by_la) in [(a, false), (b, true)] {
+    for (which, off_by_la) in [(b, false), (a, true)] { // [MUTANT: b copied first]
         let ln = if which == a { la } else { lb };
         i.local_get(base).i32_const(payload).i32_add();
         if off_by_la {
