ci/mutations/007-process-exit-neutered.patch
diff --git a/crates/almide-wasm/src/calls_modules.rs b/crates/almide-wasm/src/calls_modules.rs
index ccf06d9ba..90f1a5cf3 100644
--- a/crates/almide-wasm/src/calls_modules.rs
+++ b/crates/almide-wasm/src/calls_modules.rs
@@ -44,7 +44,7 @@ impl Emitter<'_> {
                         self.f.instructions().i32_const(1);
                     }
                 }
-                self.f.instructions().call(F_EXIT_IMPORT).unreachable();
+                self.f.instructions().drop();
                 Ok(None)
             }
             CallTarget::Module { module, func, .. }
