ci/mutations/011-nested-test-always-true.patch
diff --git a/crates/almide-wasm/src/patterns.rs b/crates/almide-wasm/src/patterns.rs
index 91197bf18..52cf2bd16 100644
--- a/crates/almide-wasm/src/patterns.rs
+++ b/crates/almide-wasm/src/patterns.rs
@@ -413,7 +413,8 @@ impl Emitter<'_> {
     pub(crate) fn test_nested(&mut self, ap: &IrPattern, fty: SliceTy) -> Result<(), EmitError> {
         let h = self.hold_val(fty)?;
         self.f.instructions().local_set(h);
-        self.emit_pattern_test(ap, fty, h)?;
+        let _ = (ap, h);
+        self.f.instructions().i32_const(1);
         self.release_val(fty);
         Ok(())
     }
