ci/mutations/013-effect-ok-tag-inverted.patch
diff --git a/crates/almide-wasm/src/emitter.rs b/crates/almide-wasm/src/emitter.rs
index 7f8ea2853..eacf52973 100644
--- a/crates/almide-wasm/src/emitter.rs
+++ b/crates/almide-wasm/src/emitter.rs
@@ -109,7 +109,7 @@ impl Emitter<'_> {
             .i32_const(16)
             .call(F_ALLOC)
             .local_tee(hb)
-            .i32_const(0)
+            .i32_const(1)
             .i32_store(slot_memarg(almide_layout::SUM_TAG));
         self.f.instructions().local_get(hb).local_get(hv);
         self.store_ty_slot(raw, almide_layout::SUM_FIELD);
