ci/mutations/015-anon-field-positional.patch
diff --git a/crates/almide-wasm/src/emitter.rs b/crates/almide-wasm/src/emitter.rs
index 65c18328a..02842c52c 100644
--- a/crates/almide-wasm/src/emitter.rs
+++ b/crates/almide-wasm/src/emitter.rs
@@ -1259,11 +1259,9 @@ impl Emitter<'_> {
                     return unsup("anon-record-defaults");
                 }
                 let mut slots = Vec::new();
-                for (fname, _) in fields {
-                    match def.fields.iter().find(|fi| fi.name == fname.as_str()) {
-                        Some(fi) => slots.push((fi.ty, fi.offset)),
-                        None => return unsup("anon-record-unknown-field"),
-                    }
+                for (i, _) in fields.iter().enumerate() {
+                    let fi = &def.fields[i];
+                    slots.push((fi.ty, fi.offset));
                 }
                 let size = def.size;
                 let hold = self.hold_i32()?;
