ci/mutations/017-list-display-sep-short.patch
diff --git a/crates/almide-wasm/src/calls.rs b/crates/almide-wasm/src/calls.rs
index 85ece370e..dbb039bad 100644
--- a/crates/almide-wasm/src/calls.rs
+++ b/crates/almide-wasm/src/calls.rs
@@ -1028,7 +1028,7 @@ impl Emitter<'_> {
                         .i32_ne()
                         .if_(BlockType::Empty);
                 }
-                self.append_lit(", ");
+                self.append_lit(",");
                 self.f.instructions().end();
                 self.f.instructions().local_get(cur);
                 self.load_ty_slot_at(el);
