ci/mutations/019-captures-not-stored.patch
diff --git a/crates/almide-wasm/src/emitter_values.rs b/crates/almide-wasm/src/emitter_values.rs
index 730bdb293..7c4bc6a71 100644
--- a/crates/almide-wasm/src/emitter_values.rs
+++ b/crates/almide-wasm/src/emitter_values.rs
@@ -122,18 +122,7 @@ impl Emitter<'_> {
                         .i32_store(slot_memarg(0));
                     for (v, t, off, is_cell) in &captures {
                         let (idx, _) = self.locals[v];
-                        self.f.instructions().local_get(hb).local_get(idx);
-                        if *is_cell {
-                            // the local already holds the cell address
-                            self.f.instructions().i32_store(slot_memarg(*off));
-                        } else {
-                            // The env is a holder: a captured handle takes +1
-                            // (leak-not-dangle until closures drop, #2010) —
-                            // a tail-called closure returning its capture read
-                            // the frame's released local (fuzz 20260909).
-                            self.share_handle_top(*t);
-                            self.store_ty_slot(*t, *off);
-                        }
+                        let _ = (idx, t, off, is_cell); // [MUTANT: captures not stored]
                     }
                     self.f.instructions().local_get(hb);
                     self.release_i32();
