ci/mutations/020-index-assign-header-write.patch
diff --git a/crates/almide-wasm/src/emitter.rs b/crates/almide-wasm/src/emitter.rs
index e7282d896..8b4493fb9 100644
--- a/crates/almide-wasm/src/emitter.rs
+++ b/crates/almide-wasm/src/emitter.rs
@@ -364,9 +364,7 @@ impl Emitter<'_> {
                         .i64_const(stride)
                         .i64_mul()
                         .i64_add()
-                        .i32_wrap_i64()
-                        .i32_const(almide_layout::PAYLOAD as i32)
-                        .i32_add();
+                        .i32_wrap_i64();
                     i.local_get(hv);
                 }
                 self.store_ty_slot_raw(el);
