ci/mutations/020-index-assign-header-write.patch
diff --git a/crates/almide-wasm/src/stmts_index.rs b/crates/almide-wasm/src/stmts_index.rs
index 02ed8c7b4..501570900 100644
--- a/crates/almide-wasm/src/stmts_index.rs
+++ b/crates/almide-wasm/src/stmts_index.rs
@@ -25,9 +25,7 @@ impl Emitter<'_> {
             .i64_const(stride)
             .i64_mul()
             .i64_add()
-            .i32_wrap_i64()
-            .i32_const(almide_layout::PAYLOAD as i32)
-            .i32_add();
+            .i32_wrap_i64(); // [MUTANT: header write]
     }
 
     /// `xs[i] = v` — copy-on-write (split from lower_stmt for the complexity budget).
