ci/mutations/021-value-tag-shifted.patch
diff --git a/crates/almide-wasm/src/value.rs b/crates/almide-wasm/src/value.rs
index 64ef55caa..2073705c0 100644
--- a/crates/almide-wasm/src/value.rs
+++ b/crates/almide-wasm/src/value.rs
@@ -115,7 +115,7 @@ impl Emitter<'_> {
             .i32_const(16)
             .call(F_ALLOC)
             .local_tee(hb)
-            .i32_const(tag)
+            .i32_const(tag + 1)
             .i32_store(slot_memarg(almide_layout::SUM_TAG));
         if let (Some(h), Some(k)) = (hv, payload_kind) {
             self.f.instructions().local_get(hb).local_get(h);
