ci/mutations/022-map-literal-reversed.patch
diff --git a/crates/almide-wasm/src/emitter.rs b/crates/almide-wasm/src/emitter.rs
index 117c6651f..2e3c4e5b6 100644
--- a/crates/almide-wasm/src/emitter.rs
+++ b/crates/almide-wasm/src/emitter.rs
@@ -551,6 +551,7 @@ impl Emitter<'_> {
                     kind: IrExprKind::List {
                         elements: entries
                             .iter()
+                            .rev()
                             .map(|(k, v)| IrExpr {
                                 kind: IrExprKind::Tuple {
                                     elements: vec![k.clone(), v.clone()],
