ci/mutations/029-deferred-range-inclusive-dropped.patch
diff --git a/crates/almide-wasm/src/stmts.rs b/crates/almide-wasm/src/stmts.rs
index e895a646f..17782ccc1 100644
--- a/crates/almide-wasm/src/stmts.rs
+++ b/crates/almide-wasm/src/stmts.rs
@@ -386,7 +386,7 @@ impl Emitter<'_> {
         let mut i = self.f.instructions();
         i.local_get(var_idx).local_get(stop);
         if inclusive {
-            i.i64_gt_s();
+            i.i64_ge_s(); // [MUTANT: inclusive off-by-one]
             i.local_get(var_idx).local_get(floor).i64_lt_s();
             i.i32_or();
         } else {
