ci/mutations/032-list-min-float-inverted.patch
diff --git a/crates/almide-wasm/src/list_order.rs b/crates/almide-wasm/src/list_order.rs
index 47ecc8167..5be692536 100644
--- a/crates/almide-wasm/src/list_order.rs
+++ b/crates/almide-wasm/src/list_order.rs
@@ -210,7 +210,7 @@ impl Emitter<'_> {
                             i.i64_xor();
                         }
                         if is_min {
-                            i.i64_lt_s();
+                            i.i64_gt_s(); // [MUTANT: min/max inverted]
                         } else {
                             i.i64_gt_s();
                         }
