ci/mutations/035-while-charge-dropped.patch
diff --git a/crates/almide-wasm/src/stmts.rs b/crates/almide-wasm/src/stmts.rs
index 9c9c23cf4..abc993456 100644
--- a/crates/almide-wasm/src/stmts.rs
+++ b/crates/almide-wasm/src/stmts.rs
@@ -94,9 +94,7 @@ impl Emitter<'_> {
     /// charges — the interp's per-check meter), `break` to the block.
     fn lower_while(&mut self, cond: &IrExpr, body: &[IrStmt]) -> Result<(), EmitError> {
         self.f.instructions().block(BlockType::Empty).loop_(BlockType::Empty);
-        // Deterministic meter: one loop-head charge per condition
-        // CHECK (n iterations = n+1 checks), ALS-DT2.
-        self.emit_det_charge_const(1);
+        // [MUTANT: while loop-head charge dropped]
         self.lower(cond, Some(BOOL))?;
         self.f.instructions().i32_eqz().br_if(1);
         self.lower_loop_body(body, false)?;
