ci/mutations/038-tco-param-order-forward.patch
diff --git a/crates/almide-wasm/src/tco.rs b/crates/almide-wasm/src/tco.rs
index 2af51f952..80162dd45 100644
--- a/crates/almide-wasm/src/tco.rs
+++ b/crates/almide-wasm/src/tco.rs
@@ -75,8 +75,8 @@ pub(crate) fn loop_convert(
             wasmparser::Operator::ReturnCall { function_index }
                 if *function_index == self_idx =>
             {
-                for p in (0..param_vts.len() as u32).rev() {
-                    out.instructions().local_set(p);
+                for p in 0..param_vts.len() as u32 {
+                    out.instructions().local_set(p); // [MUTANT: reverse order dropped]
                 }
                 out.instructions().br(depth - 1);
                 continue;
