ci/mutations/041-cell-bind-alloc-dropped.patch
diff --git a/crates/almide-wasm/src/stmts.rs b/crates/almide-wasm/src/stmts.rs
index abe6f3302..c0213f23e 100644
--- a/crates/almide-wasm/src/stmts.rs
+++ b/crates/almide-wasm/src/stmts.rs
@@ -250,7 +250,7 @@ impl Emitter<'_> {
         } else if self.rc_droppable(declared) && !self.rc_owned_result(value) {
             self.rc_inc_top();
         }
-        if self.cells.contains(var) {
+        if false && self.cells.contains(var) { // [MUTANT]
             // C-319: the bind allocates the shared cell; the
             // local holds its ADDRESS from here on.
             let hv = self.hold_val(declared)?;
