ci/mutations/043-exit-release-dropped.patch
diff --git a/crates/almide-wasm/src/exit_plan.rs b/crates/almide-wasm/src/exit_plan.rs
index c60de10cc..28ad8c600 100644
--- a/crates/almide-wasm/src/exit_plan.rs
+++ b/crates/almide-wasm/src/exit_plan.rs
@@ -127,8 +127,7 @@ impl Emitter<'_> {
             if omit_first && k == 0 {
                 continue;
             }
-            let dec = self.dec_fn_of_local(idx);
-            self.f.instructions().local_get(idx).call(dec);
+            let _ = idx; // [MUTANT: exit releases dropped]
         }
         match plan.continuation {
             Continuation::ReturnSuccess => {
