proofs/conformance-mutations/m1-swap-match-arms.patch
diff --git a/crates/almide-codegen/src/walker/statements_box_patterns.rs b/crates/almide-codegen/src/walker/statements_box_patterns.rs
index fda10af49..30b336233 100644
--- a/crates/almide-codegen/src/walker/statements_box_patterns.rs
+++ b/crates/almide-codegen/src/walker/statements_box_patterns.rs
@@ -392,12 +392,12 @@ pub fn render_pattern_hinted(ctx: &RenderContext, pat: &IrPattern, enum_hint: Op
         IrPattern::None => template_or(ctx, "pattern_none", &[], "None"),
         IrPattern::Ok { inner } => {
             let binding_s = render_pattern(ctx, inner);
-            ctx.templates.render_with("pattern_ok", None, &[], &[("binding", binding_s.as_str())])
+            ctx.templates.render_with("pattern_err", None, &[], &[("binding", binding_s.as_str())])
                 .unwrap_or_else(|| format!("Ok(_)"))
         }
         IrPattern::Err { inner } => {
             let binding_s = render_pattern(ctx, inner);
-            ctx.templates.render_with("pattern_err", None, &[], &[("binding", binding_s.as_str())])
+            ctx.templates.render_with("pattern_ok", None, &[], &[("binding", binding_s.as_str())])
                 .unwrap_or_else(|| format!("Err(_)"))
         }
         IrPattern::Constructor { name, args } => render_pattern_constructor(ctx, name, args, enum_hint),
