proofs/conformance-mutations/m2-drop-err-turbofish.patch
diff --git a/crates/almide-codegen/src/walker/expressions.rs b/crates/almide-codegen/src/walker/expressions.rs
index 61ad3badf..3fdc49de6 100644
--- a/crates/almide-codegen/src/walker/expressions.rs
+++ b/crates/almide-codegen/src/walker/expressions.rs
@@ -289,7 +289,7 @@ fn render_expr_result_err(ctx: &RenderContext, inner: &IrExpr, ty: &Ty) -> Strin
     // victim), and a concrete non-Unit ok side is already pinned by that
     // context (pinning it AGAIN node-locally broke the guard-`return (Err)?`
     // and tuple-payload fallible-lambda shapes — #1434, first-bad b1ef4e70a).
-    let ok_is_checker_default = matches!(
+    let ok_is_checker_default = false && matches!(
         ty,
         Ty::Applied(TypeConstructorId::Result, a) if a.len() == 2 && matches!(&a[0], Ty::Unit)
     );
