proofs/conformance-mutations/m4-reverse-stmt-order.patch
diff --git a/crates/almide-codegen/src/walker/helpers.rs b/crates/almide-codegen/src/walker/helpers.rs
index 0736d79ea..62d8af95f 100644
--- a/crates/almide-codegen/src/walker/helpers.rs
+++ b/crates/almide-codegen/src/walker/helpers.rs
@@ -128,6 +128,7 @@ pub fn render_body_content(ctx: &RenderContext, expr: &almide_ir::IrExpr) -> Str
         IrExprKind::Block { stmts, expr: tail } => {
             let mut parts: Vec<String> = stmts.iter()
                 .map(|s| terminate_stmt(ctx, super::statements::render_stmt(ctx, s)))
+                .rev()
                 .collect();
             if let Some(e) = tail {
                 let expr_str = super::expressions::render_expr_owned(ctx, e);
