proofs/conformance-mutations/m4-reverse-stmt-order.patch
diff --git a/crates/almide-codegen/src/walker/expressions.rs b/crates/almide-codegen/src/walker/expressions.rs
index 1574ba7b1..f5b0f079d 100644
--- a/crates/almide-codegen/src/walker/expressions.rs
+++ b/crates/almide-codegen/src/walker/expressions.rs
@@ -12,7 +12,7 @@ use super::helpers::{template_or, terminate_stmt, indent_lines, render_body_cont
 /// Render a statement list. Peephole patterns are detected at IR level
 /// by PeepholePass; this just renders the resulting IR nodes.
 fn render_stmts(ctx: &RenderContext, stmts: &[IrStmt]) -> Vec<String> {
-    stmts.iter().map(|s| render_stmt(ctx, s)).collect()
+    stmts.iter().map(|s| render_stmt(ctx, s)).rev().collect()
 }
 
 /// Mangle a type into the monomorphization suffix form (mirrors mono/utils.rs).
