proofs/conformance-mutations/m5-double-wasm-print.patch
Mutant m5: emit every wasm print twice (the wasm-only divergence).

Seeded into the STRUCTURAL emitter's print lowering (crates/almide-wasm
lower_print, both the interpolation branch — the flush call issued twice —
and the String-block branch — the argument lowered and printed twice):
the default wasm leg since 0.60 (#1696), and the leg the conformance
runner builds every corpus program on (48/48 via `almide build --target
wasm` with no ALMIDE_WASM_INCUMBENT). The previous form of this mutant
seeded the same bug into the incumbent renderer (almide-mir
render_wasm_c.rs, RtFn::PrintStr) and SURVIVED seven nights once the
route flipped: the runner never executed that code, so nothing could
kill it (#1845). The incumbent carries no mutant now. A mutant on a leg
the corpus does not build on is not evidence, it is noise.

diff --git a/crates/almide-wasm/src/calls.rs b/crates/almide-wasm/src/calls.rs
index b7c1d7f84..4baa1bf15 100644
--- a/crates/almide-wasm/src/calls.rs
+++ b/crates/almide-wasm/src/calls.rs
@@ -537,6 +537,9 @@ impl Emitter<'_> {
                 .local_get(self.cursor_local)
                 .call(flush)
                 .local_get(start)
+                .local_get(self.cursor_local)
+                .call(flush)
+                .local_get(start)
                 .global_set(G_LINE_CURSOR);
             self.release_i32();
             return Ok(());
@@ -547,6 +550,8 @@ impl Emitter<'_> {
         // `ArgMode`), there being no module-call wrapper around a Named
         // builtin.
         self.arm_scope(|em| {
+            em.lower_arg(arg, Some(STR), ArgMode::Borrow)?;
+            em.f.instructions().call(block_print);
             em.lower_arg(arg, Some(STR), ArgMode::Borrow)?;
             em.f.instructions().call(block_print);
             Ok(())
